import streamlit as st
import pandas as pd
import numpy as np
st.set_page_config(page_title="南宁美食数据",page_icon="🍱")
# 餐厅数据
restaurants = pd.DataFrame({
    "餐厅": ["才湾人", "蛙月荷", "红灯记", "海底捞火锅", "西扒士牛排"],
    "类型": ["快餐", "干锅", "火锅", "火锅", "西餐"],
    "评分": [4.8, 4.5, 4.2, 4.7, 4.1],
    "人均消费(元)": [35, 45, 40, 70, 20],
    "latitude": [22.834198, 22.869925, 22.790563, 22.814160, 22.839736],
    "longitude": [108.300890, 108.291204, 108.313517, 108.321510, 108.265754],
    
})



# 设置索引列的名称
restaurants.index.name='序号'
st.subheader('📍南宁美食地图')
st.map(restaurants)


st.header("⭐餐厅评分")
# 通过x指定月份所在这一列为条形图的x轴
st.bar_chart(restaurants, x='餐厅',y="评分")


data = {
    '月份':['01月', '02月', '03月','04月', '05月', '06月','07月', '08月', '09月','10月', '11月', '12月'],
    '才湾人':[20, 15, 18,11,14,9,10,12,17,21,24,26],
    '蛙月荷':[12, 16, 12,20,23,26,27,17,19,20,22,21],
    '红灯记':[11, 10, 16,20,24,23,21,16,25,14,18,11],
    '海底捞火锅':[32, 36,42,30,52,45,48,38,39,36,41,44],
    '西扒士牛排':[11,10,16,9,10,8,12,14,11,17,18,20]

}
df = pd.DataFrame(data)
index = pd.Series([1, 2, 3,4,5,6,7,8,9,10,11,12], name='序号')
df.index = index

st.header("📊餐厅数据")
st.line_chart(df, x='月份')

data1 = {
    '时段':[ '00-2','2-4', '4-6', '6-8','8-10', '10-12', '12-14','14-16', '16-18', '18-20','20-22', '22-24'],
    '才湾人':[0, 0, 0,0,14,9,10,12,17,21,24,0],
    '蛙月荷':[0, 0, 0,0,23,26,27,17,19,20,22,0],
    '红灯记':[0, 0, 0,0,24,23,21,16,25,14,18,0],
    '海底捞火锅':[32, 36,42,30,52,45,48,38,39,36,41,44],
    '西扒士牛排':[0,0,0,0,10,8,12,14,11,17,18,0]

}
df1 = pd.DataFrame(data1)
df1.index = index
st.header("用餐高峰时段")
# 通过x指定月份所在这一列为面积图的x轴
st.area_chart(df1, x='时段')


